case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
    "libNEPCM.so"
)

application     chtNEPCMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         700000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.7;

adjustTimeStep  yes;

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
{
    postProcess
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        name			postProcess;
        region			leftSolid;
        enabled			true;
        outputControl		outputTime;//timeStep;
        redirectType		postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);

            //- dimensionless numbers
            scalar rhobf = 996.5;
            scalar mubf = 8.5e-4;
            scalar kappabf = 0.628;
            scalar Cpbf = 4181.0;
            scalar betabf = 2.0e-5;
            scalar nubf = mubf/rhobf;
            scalar alphabf = kappabf/(rhobf*Cpbf);
            scalar deltaTemp = 10.0;
            scalar charL = 1.0;
            scalar g = 6.43e-5;

            scalar Prbf = nubf/alphabf;
            scalar Grbf = (g*betabf*deltaTemp*pow(charL,3)) / (pow(nubf,2));
            scalar Rabf = (g*betabf*deltaTemp*pow(charL,3)) / (nubf*alphabf);


            //- lookup fields
            const volScalarField& T = mesh().lookupObject<volScalarField>("T");
            const volScalarField& Kappa = mesh().lookupObject<volScalarField>("Kappa");
            surfaceScalarField gradT = fvc::snGrad(T);

            //- find id and compute Nusselt number
            label leftID = T.mesh().boundaryMesh().findPatchID("left");
            scalar leftArea = sum(T.mesh().magSf().boundaryField()[leftID]);
            scalar leftHeatFluxAvg = sum(Kappa.boundaryField()[leftID]*gradT.boundaryField()[leftID]*T.mesh().magSf().boundaryField()[leftID])/leftArea;
            scalar lefthAvg = leftHeatFluxAvg/deltaTemp;
            scalar NusseltAvg = (lefthAvg*charL)/(kappabf);
            Info << "NusseltAvg = " << NusseltAvg << "\n";

            //- save data
            output << NusseltAvg << "\n";
            output.close();
        #};
    }

}

// ************************************************************************* //
