case/constant/chamber/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  NEPCM;
type            naturalConvection;

//nu		nu [0 2 -1 0 0 0 0]	0.85e-6;
Prt		Prt [0 0 0 0 0 0 0]	0.85;
TRef            TRef [0 0 0 1 0 0 0]	312;

rho		rho [1 -3 0 0 0 0 0]	996.5;
Cp		Cp [0 2 -2 -1 0 0 0]	4181;
kappa		kappa [ 1 1 -3 -1 0 0 0 ] 0.628;
mu		mu [ 1 -1 -1 0 0 0 0 ] 8.5e-4;
beta            beta [0 0 0 -1 0 0 0]	2e-5;

// ************************************************************************* //
